"""
Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом:
for el in fact(n).
Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел,
начиная с 1! и до n!.
Подсказка: факториал числа n — произведение чисел от 1 до n.
Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.
"""
from math import factorial

def fact(n):
    for el in range(1, n + 1):
        yield el
    for el in fact(n=4):
        print(el)

print(factorial(4))
-------------------------------------
def fact_2(n):
    num = 1
    for i in range(1,n+1):
        num *= i
        yield num

for el in fact_2(5):
    print(el)